Revit 2027 API
MasonryCMUType Enumeration
 The enumerated type representing the permitted values for the asset property "MasonryCMUType" from the "MasonryCMU" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum MasonryCMUType
Public Enumeration MasonryCMUType
public enum class MasonryCMUType
type MasonryCMUType
Members
Member name | Value | Description
Cmu | 0
Masonry | 1
See Also
Reference
Autodesk.Revit.DB.Visual Namespace